const bookData = {
    'vol1': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 1]",
        cover: "assets/EngineeringtheHeart_1.png", 
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "บทนำ", file: "books/vol1/บทนำ.epub" },
            { name: "ตอนที่ 1 : ปีกเหล็กกลางสายน้ำ", file: "books/vol1/ตอนที่ 1_ ปีกเหล็กกลางสายน้ำ.epub" },
            { name: "ตอนที่ 2 : บททดสอบแรกใต้เงาฉำฉา", file: "books/vol1/ตอนที่ 2_บททดสอบแรกใต้เงาฉำฉา.epub" },
            { name: "ตอนที่ 3 : ปริศนาสายลมบนรถม่วง", file: "books/vol1/ตอนที่ 3_ ปริศนาสายลมบนรถม่วง.epub" },
            { name: "ตอนที่ 4 : วันแรกในรั้วม่วง", file: "books/vol1/ตอนที่ 4_ วันแรกในรั้วม่วง.epub" },
            { name: "ตอนที่ 5 : นอกตำรา... ที่ย่านหลังมอ", file: "books/vol1/ตอนที่ 5_ นอกตำรา... ที่ย่านหลังมอ.epub" },
            { name: "ตอนที่ 6 : กลิ่นดินและฟันเฟือง", file: "books/vol1/ตอนที่ 6_ กลิ่นดินและฟันเฟือง.epub" },
            { name: "ตอนที่ 7 : เผือกร้อน", file: "books/vol1/ตอนที่ 7_ เผือกร้อน.epub" },
            { name: "ตอนที่ 8 : แสงและเงาที่อ่างแก้ว", file: "books/vol1/ตอนที่ 8_ แสงและเงาที่อ่างแก้ว.epub" },
            { name: "ตอนที่ 9 : วันตัดสิน CMU Ambassador", file: "books/vol1/ตอนที่ 9_ วันตัดสิน CMU Ambassador.epub" },
            { name: "ตอนที่ 10 : กำไรที่ประเมินค่าไม่ได้", file: "books/vol1/ตอนที่ 10_ กำไรที่ประเมินค่าไม่ได้.epub" },
            { name: "ตอนที่ 11 : ศึกหมูกระทะ", file: "books/vol1/ตอนที่ 11_ ศึกหมูกระทะ.epub" },
            { name: "ตอนที่ 12 : ระยะห่างที่สะเมิง", file: "books/vol1/ตอนที่ 12_ ระยะห่างที่สะเมิง.epub" },
            { name: "ตอนที่ 12.5 : กลไกของหยาดเหงื่อ", file: "books/vol1/ตอนที่ 12.5_ กลไกของหยาดเหงื่อ.epub" },
            { name: "ตอนที่ 13 : กลิ่นแกงแค", file: "books/vol1/ตอนที่ 13_ กลิ่นแกงแค.epub" },
            { name: "ตอนที่ 14 : พันธสัญญาขันเงิน", file: "books/vol1/ตอนที่ 14_ พันธสัญญาขันเงิน.epub" },
            { name: "ตอนที่ 14.5 : กลิ่นหอมของดอกปีบ", file: "books/vol1/ตอนที่ 14.5_ กลิ่นหอมของดอกปีบ.epub" },
            { name: "ตอนที่ 15 : จังหวะชีวิตปกติที่เปลี่ยนไป", file: "books/vol1/ตอนที่ 15_ จังหวะชีวิตปกติที่เปลี่ยนไป.epub" },
            { name: "ตอนที่ 16 : ประกาศนียบัตรแห่งความชัดเจน", file: "books/vol1/ตอนที่ 16_ ประกาศนียบัตรแห่งความชัดเจน.epub" },
            { name: "ตอนที่ 17 : หัวใจที่นอกเหนือการควบคุม", file: "books/vol1/ตอนที่ 17_ หัวใจที่นอกเหนือการควบคุม.epub" },
            { name: "ตอนที่ 18 : คลื่นใต้น้ำ", file: "books/vol1/ตอนที่ 18_ คลื่นใต้น้ำ.epub" },
            { name: "ตอนที่ 19 : โค้งขุนกันต์... พิกัดแห่งหัวใจ", file: "books/vol1/ตอนที่ 19_ โค้งขุนกันต์... พิกัดแห่งหัวใจ.epub" },
            { name: "ตอนที่ 20 : ปลายทางที่ความทรงจำ", file: "books/vol1/ตอนที่ 20_ ปลายทางที่ความทรงจำ.epub" },
            { name: "ตอนที่ 21 : รอยต่อของฤดูกาล", file: "books/vol1/ตอนที่ 21_ รอยต่อของฤดูกาล.epub" },
            { name: "ตอนที่ 22 : ฟันเฟืองประคองช่อม่วง", file: "books/vol1/ตอนที่ 22_ ฟันเฟืองประคองช่อม่วง.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวที่ผิดเพี้ยน (POV ของภัทร)", file: "books/vol1/ตอนพิเศษ_ พิมพ์เขียวที่ผิดเพี้ยน (POV ของภัทร).epub" },
            { name: "ตอนพิเศษ : กลไกที่รัดวงจร (POV ของจิน & ไทม์)", file: "books/vol1/ตอนพิเศษ_ กลไกที่รัดวงจร (POV_ จิน & ไทม์).epub" }

        ]
    },
    'vol2': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 2]",
        cover: "assets/EngineeringtheHeart_2.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 23 : พันธะสัญญาที่ข้อมือ", file: "books/vol2/ตอนที่ 23_ พันธะสัญญาที่ข้อมือ.epub" },
            { name: "ตอนที่ 24 : รอยยิ้มกลางสนาม", file: "books/vol2/ตอนที่ 24_ รอยยิ้มกลางสนาม.epub" },
            { name: "ตอนที่ 25 : ประตูที่กลางใจ", file: "books/vol2/ตอนที่ 25_ ประตูที่กลางใจ.epub" },
            { name: "ตอนที่ 25.5 : วิศวะสายเปย์ (ฉบับลับหลัง)", file: "books/vol2/ตอนที่ 25.5_ วิศวะสายเปย์ (ฉบับลับหลัง).epub" },
            { name: "ตอนที่ 26 : หยดน้ำแห่งสะเมิง", file: "books/vol2/ตอนที่ 26_ หยดน้ำแห่งสะเมิง.epub" },
            { name: "ตอนที่ 27 : พันธสัญญาแห่งสายน้ำ", file: "books/vol2/ตอนที่ 27_ พันธสัญญาแห่งสายน้ำ.epub" },
            { name: "ตอนที่ 28 : กลิ่นดินยามเช้า", file: "books/vol2/ตอนที่ 28_ กลิ่นดินยามเช้า.epub" },
            { name: "ตอนที่ 29 : องศาที่ขยับเข้าหากัน", file: "books/vol2/ตอนที่ 29_ องศาที่ขยับเข้าหากัน.epub" },
            { name: "ตอนที่ 30 : กลิ่นดินในคำตอบ", file: "books/vol2/ตอนที่ 30_ กลิ่นดินในคำตอบ.epub" },
            { name: "ตอนที่ 31 : ทะเลสีคราม", file: "books/vol2/ตอนที่ 31_ ทะเลสีคราม.epub" },
            { name: "ตอนที่ 32 : ปีกสีขาวเหนือผืนน้ำมรกต", file: "books/vol2/ตอนที่ 32_ ปีกสีขาวเหนือผืนน้ำมรกต.epub" },
            { name: "ตอนที่ 33 : เส้นขนานบนหอคอยกระจก", file: "books/vol2/ตอนที่ 33_ เส้นขนานบนหอคอยกระจก.epub" },
            { name: "ตอนที่ 34 : รอยร้าวในแก้วคริสตัล", file: "books/vol2/ตอนที่ 34_ รอยร้าวในแก้วคริสตัล.epub" },
            { name: "ตอนที่ 35 : โลกที่แตกต่างและทางเลือกของหัวใจ", file: "books/vol2/ตอนที่ 35_ โลกที่แตกต่างและทางเลือกของหัวใจ.epub" },
            { name: "ตอนที่ 36 : คำตอบใต้แสงดาว", file: "books/vol2/ตอนที่ 36_ คำตอบใต้แสงดาว.epub" },
            { name: "ตอนที่ 37 : เกียรติแห่งหัวใจ", file: "books/vol2/ตอนที่ 37_ เกียรติแห่งหัวใจ.epub" },
            { name: "ตอนที่ 38 : ทะเลสีมรกตและมิตรภาพ", file: "books/vol2/ตอนที่ 38_ ทะเลสีมรกตและมิตรภาพ.epub" },
            { name: "ตอนที่ 39 : รสชาติของความสุข", file: "books/vol2/ตอนที่ 39_ รสชาติของความสุข.epub" },
            { name: "ตอนที่ 40 : ป้อมปราการที่มองไม่เห็น", file: "books/vol2/ตอนที่ 40_ ป้อมปราการที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 40.5 : ค่ำคืนใต้แสงดาว... และเสียงหัวใจ", file: "books/vol2/ตอนที่ 40.5_ ค่ำคืนใต้แสงดาว... และเสียงหัวใจ.epub" },
            { name: "ตอนที่ 41 : หยาดเหงื่อแห่งความจริงใจ", file: "books/vol2/ตอนที่ 41_ หยาดเหงื่อแห่งความจริงใจ.epub" },
            { name: "ตอนที่ 42 : หัวใจที่ไม่ได้มีแค่ปีกเหล็ก", file: "books/vol2/ตอนที่ 42_ หัวใจที่ไม่ได้มีแค่ปีกเหล็ก.epub" },
            { name: "ตอนที่ 43 : รอยจารึกบนลานเกียร์", file: "books/vol2/ตอนที่ 43_ รอยจารึกบนลานเกียร์.epub" },
            { name: "ตอนที่ 44 : เงาในลอนดอน", file: "books/vol2/ตอนที่ 44_ เงาในลอนดอน.epub" },
            { name: "ตอนที่ 45 : กำแพงที่มองไม่เห็น", file: "books/vol2/ตอนที่ 45_ กำแพงที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 46 : ดาวดิน 2.0", file: "books/vol2/ตอนที่ 46_ ดาวดิน 2.0.epub" },
            { name: "ตอนที่ 47 : คำเตือนจากขอบฟ้าไกล", file: "books/vol2/ตอนที่ 47_ คำเตือนจากขอบฟ้าไกล.epub" },
            { name: "ตอนที่ 48 : เดิมพันกลางม่านฝน", file: "books/vol2/ตอนที่ 48_ เดิมพันกลางม่านฝน.epub" },
            { name: "ตอนที่ 49 : พันธนาการใต้ซากปรัก", file: "books/vol2/ตอนที่ 49_ พันธนาการใต้ซากปรัก.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวใบแรกของความทรงจำ", file: "books/vol2/ตอนพิเศษ_ พิมพ์เขียวใบแรกของความทรงจำ.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวที่อาบด้วยน้ำตา", file: "books/vol2/ตอนพิเศษ_ พิมพ์เขียวที่อาบด้วยน้ำตา.epub" }
        ]
    },
    'vol3': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 3]",
        cover: "assets/EngineeringtheHeart_3.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 1 : จุดเริ่มต้นครั้งใหม่", file: "books/vol2/ตอนที่ 1_ เล่ม2.epub" }
        ]
    }
};