const bookData = {
    'Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 1]': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 1]",
        cover: "assets/EngineeringtheHeart_1.png", 
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "บทนำ", file: "books/vol1/บทนำ.epub" },
            { name: "ตอนที่ 1 : ปีกเหล็กกลางสายน้ำ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 1_ ปีกเหล็กกลางสายน้ำ.epub" },
            { name: "ตอนที่ 2 : บททดสอบแรกใต้เงาฉำฉา", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 2_บททดสอบแรกใต้เงาฉำฉา.epub" },
            { name: "ตอนที่ 3 : ปริศนาสายลมบนรถม่วง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 3_ ปริศนาสายลมบนรถม่วง.epub" },
            { name: "ตอนที่ 4 : วันแรกในรั้วม่วง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 4_ วันแรกในรั้วม่วง.epub" },
            { name: "ตอนที่ 5 : นอกตำรา... ที่ย่านหลังมอ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 5_ นอกตำรา... ที่ย่านหลังมอ.epub" },
            { name: "ตอนที่ 6 : กลิ่นดินและฟันเฟือง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 6_ กลิ่นดินและฟันเฟือง.epub" },
            { name: "ตอนที่ 7 : เผือกร้อน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 7_ เผือกร้อน.epub" },
            { name: "ตอนที่ 8 : แสงและเงาที่อ่างแก้ว", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 8_ แสงและเงาที่อ่างแก้ว.epub" },
            { name: "ตอนที่ 9 : วันตัดสิน CMU Ambassador", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 9_ วันตัดสิน CMU Ambassador.epub" },
            { name: "ตอนที่ 10 : กำไรที่ประเมินค่าไม่ได้", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 10_ กำไรที่ประเมินค่าไม่ได้.epub" },
            { name: "ตอนที่ 11 : ศึกหมูกระทะ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 11_ ศึกหมูกระทะ.epub" },
            { name: "ตอนที่ 12 : ระยะห่างที่สะเมิง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 12_ ระยะห่างที่สะเมิง.epub" },
            { name: "ตอนที่ 12.5 : กลไกของหยาดเหงื่อ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 12.5_ กลไกของหยาดเหงื่อ.epub" },
            { name: "ตอนที่ 13 : กลิ่นแกงแค", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 13_ กลิ่นแกงแค.epub" },
            { name: "ตอนที่ 14 : พันธสัญญาขันเงิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 14_ พันธสัญญาขันเงิน.epub" },
            { name: "ตอนที่ 14.5 : กลิ่นหอมของดอกปีบ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 14.5_ กลิ่นหอมของดอกปีบ.epub" },
            { name: "ตอนที่ 15 : จังหวะชีวิตปกติที่เปลี่ยนไป", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 15_ จังหวะชีวิตปกติที่เปลี่ยนไป.epub" },
            { name: "ตอนที่ 16 : ประกาศนียบัตรแห่งความชัดเจน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 16_ ประกาศนียบัตรแห่งความชัดเจน.epub" },
            { name: "ตอนที่ 17 : หัวใจที่นอกเหนือการควบคุม", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 17_ หัวใจที่นอกเหนือการควบคุม.epub" },
            { name: "ตอนที่ 18 : คลื่นใต้น้ำ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 18_ คลื่นใต้น้ำ.epub" },
            { name: "ตอนที่ 19 : โค้งขุนกันต์... พิกัดแห่งหัวใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 19_ โค้งขุนกันต์... พิกัดแห่งหัวใจ.epub" },
            { name: "ตอนที่ 20 : ปลายทางที่ความทรงจำ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 20_ ปลายทางที่ความทรงจำ.epub" },
            { name: "ตอนที่ 21 : รอยต่อของฤดูกาล", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 21_ รอยต่อของฤดูกาล.epub" },
            { name: "ตอนที่ 22 : ฟันเฟืองประคองช่อม่วง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนที่ 22_ ฟันเฟืองประคองช่อม่วง.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวที่ผิดเพี้ยน (POV ของภัทร)", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนพิเศษ_ พิมพ์เขียวที่ผิดเพี้ยน (POV ของภัทร).epub" },
            { name: "ตอนพิเศษ : กลไกที่รัดวงจร (POV ของจิน & ไทม์)", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 1]/ตอนพิเศษ_ กลไกที่รัดวงจร (POV_ จิน & ไทม์).epub" }

        ]
    },
    'Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 2]': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 2]",
        cover: "assets/EngineeringtheHeart_2.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 23 : พันธะสัญญาที่ข้อมือ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 23_ พันธะสัญญาที่ข้อมือ.epub" },
            { name: "ตอนที่ 24 : รอยยิ้มกลางสนาม", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 24_ รอยยิ้มกลางสนาม.epub" },
            { name: "ตอนที่ 25 : ประตูที่กลางใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 25_ ประตูที่กลางใจ.epub" },
            { name: "ตอนที่ 25.5 : วิศวะสายเปย์ (ฉบับลับหลัง)", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 25.5_ วิศวะสายเปย์ (ฉบับลับหลัง).epub" },
            { name: "ตอนที่ 26 : หยดน้ำแห่งสะเมิง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 26_ หยดน้ำแห่งสะเมิง.epub" },
            { name: "ตอนที่ 27 : พันธสัญญาแห่งสายน้ำ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 27_ พันธสัญญาแห่งสายน้ำ.epub" },
            { name: "ตอนที่ 28 : กลิ่นดินยามเช้า", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 28_ กลิ่นดินยามเช้า.epub" },
            { name: "ตอนที่ 29 : องศาที่ขยับเข้าหากัน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 29_ องศาที่ขยับเข้าหากัน.epub" },
            { name: "ตอนที่ 30 : กลิ่นดินในคำตอบ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 30_ กลิ่นดินในคำตอบ.epub" },
            { name: "ตอนที่ 31 : ทะเลสีคราม", file: "books/vol2/ตอนที่ 31_ ทะเลสีคราม.epub" },
            { name: "ตอนที่ 32 : ปีกสีขาวเหนือผืนน้ำมรกต", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 32_ ปีกสีขาวเหนือผืนน้ำมรกต.epub" },
            { name: "ตอนที่ 33 : เส้นขนานบนหอคอยกระจก", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 33_ เส้นขนานบนหอคอยกระจก.epub" },
            { name: "ตอนที่ 34 : รอยร้าวในแก้วคริสตัล", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 34_ รอยร้าวในแก้วคริสตัล.epub" },
            { name: "ตอนที่ 35 : โลกที่แตกต่างและทางเลือกของหัวใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 35_ โลกที่แตกต่างและทางเลือกของหัวใจ.epub" },
            { name: "ตอนที่ 36 : คำตอบใต้แสงดาว", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 36_ คำตอบใต้แสงดาว.epub" },
            { name: "ตอนที่ 37 : เกียรติแห่งหัวใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 37_ เกียรติแห่งหัวใจ.epub" },
            { name: "ตอนที่ 38 : ทะเลสีมรกตและมิตรภาพ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 38_ ทะเลสีมรกตและมิตรภาพ.epub" },
            { name: "ตอนที่ 39 : รสชาติของความสุข", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 39_ รสชาติของความสุข.epub" },
            { name: "ตอนที่ 40 : ป้อมปราการที่มองไม่เห็น", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 40_ ป้อมปราการที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 40.5 : ค่ำคืนใต้แสงดาว... และเสียงหัวใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 40.5_ ค่ำคืนใต้แสงดาว... และเสียงหัวใจ.epub" },
            { name: "ตอนที่ 41 : หยาดเหงื่อแห่งความจริงใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 41_ หยาดเหงื่อแห่งความจริงใจ.epub" },
            { name: "ตอนที่ 42 : หัวใจที่ไม่ได้มีแค่ปีกเหล็ก", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 42_ หัวใจที่ไม่ได้มีแค่ปีกเหล็ก.epub" },
            { name: "ตอนที่ 43 : รอยจารึกบนลานเกียร์", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 43_ รอยจารึกบนลานเกียร์.epub" },
            { name: "ตอนที่ 44 : เงาในลอนดอน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 44_ เงาในลอนดอน.epub" },
            { name: "ตอนที่ 45 : กำแพงที่มองไม่เห็น", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 45_ กำแพงที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 46 : ดาวดิน 2.0", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 46_ ดาวดิน 2.0.epub" },
            { name: "ตอนที่ 47 : คำเตือนจากขอบฟ้าไกล", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 47_ คำเตือนจากขอบฟ้าไกล.epub" },
            { name: "ตอนที่ 48 : เดิมพันกลางม่านฝน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 48_ เดิมพันกลางม่านฝน.epub" },
            { name: "ตอนที่ 49 : พันธนาการใต้ซากปรัก", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนที่ 49_ พันธนาการใต้ซากปรัก.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวใบแรกของความทรงจำ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนพิเศษ_ พิมพ์เขียวใบแรกของความทรงจำ.epub" },
            { name: "ตอนพิเศษ : พิมพ์เขียวที่อาบด้วยน้ำตา", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 2]/ตอนพิเศษ_ พิมพ์เขียวที่อาบด้วยน้ำตา.epub" }
        ]
    },
    'Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 3]': {
        title: "Engineering the Heart: กลไกหัวใจนายวิศวะ [เล่ม 3]",
        cover: "assets/EngineeringtheHeart_3.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 50 : พันธนาการใต้เงาอัครโภคิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 50_ พันธนาการใต้เงาอัครโภคิน.epub" },
            { name: "ตอนที่ 51 : เขี้ยวเล็บใต้หน้ากาก", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 51_ เขี้ยวเล็บใต้หน้ากาก.epub" },
            { name: "ตอนที่ 52 : อาณาจักรใหม่และพันธสัญญา", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 52_ อาณาจักรใหม่และพันธสัญญา.epub" },
            { name: "ตอนที่ 53 : รอยร้าวในนาฬิกาทราย", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 53_ รอยร้าวในนาฬิกาทราย.epub" },
            { name: "ตอนที่ 54 : ความจริงในหยดกาแฟ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 54_ ความจริงในหยดกาแฟ.epub" },
            { name: "ตอนที่ 55 : เผชิญหน้าพญาอินทรี", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 55_ เผชิญหน้าพญาอินทรี.epub" },
            { name: "ตอนที่ 56 : รอยร้าวภายใต้ม่านหมอก", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 56_ รอยร้าวภายใต้ม่านหมอก.epub" },
            { name: "ตอนที่ 57 : ความลับใต้ปีกอินทรี", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 57_ ความลับใต้ปีกอินทรี.epub" },
            { name: "ตอนที่ 58 : ฟ้าหลังฝน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 58_ ฟ้าหลังฝน.epub" },
            { name: "ตอนที่ 59 : พันธสัญญาแห่งดอยสูงและตึกระฟ้า", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 59_ พันธสัญญาแห่งดอยสูงและตึกระฟ้า.epub" },
            { name: "ตอนที่ 60 : รอยเท้าบนทางขนาน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 60_ รอยเท้าบนทางขนาน.epub" },
            { name: "ตอนที่ 61 : คลื่นใต้น้ำในอาณาจักรแก้ว", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 61_ คลื่นใต้น้ำในอาณาจักรแก้ว.epub" },
            { name: "ตอนที่ 62 : กลิ่นกาสะลองบนรันเวย์สายใหม่", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 62_ กลิ่นกาสะลองบนรันเวย์สายใหม่.epub" },
            { name: "ตอนที่ 63 : รอยร้าวในแสงอรุณ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 63_ รอยร้าวในแสงอรุณ.epub" },
            { name: "ตอนที่ 64 : พันธสัญญาเหนือกาลเวลา", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 64_ พันธสัญญาเหนือกาลเวลา.epub" },
            { name: "ตอนที่ 65 : ปีกที่โบยบิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 65_ ปีกที่โบยบิน.epub" },
            { name: "ตอนที่ 66 : บัญชีเลือด", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 66_ บัญชีเลือด.epub" },
            { name: "ตอนที่ 67 : รอยเท้าบนแผ่นดินใหม่", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 67_ รอยเท้าบนแผ่นดินใหม่.epub" },
            { name: "ตอนที่ 68 : พยัคฆ์ถอดกรงเล็บ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 68_ พยัคฆ์ถอดกรงเล็บ.epub" },
            { name: "ตอนที่ 69 : กับดักกลางกระดานแก้ว", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 69_ กับดักกลางกระดานแก้ว.epub" },
            { name: "ตอนที่ 70 : ประตูที่ไร้กุญแจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 70_ ประตูที่ไร้กุญแจ.epub" },
            { name: "ตอนที่ 71 : อุ่นไอรักข้ามทวีป", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 71_ อุ่นไอรักข้ามทวีป.epub" },
            { name: "ตอนที่ 72 : ปลายทางของความคิดถึง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 72_ ปลายทางของความคิดถึง.epub" },
            { name: "ตอนที่ 73 : คำสาบานใต้เงาไม้ศักดิ์สิทธิ์", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 73_ คำสาบานใต้เงาไม้ศักดิ์สิทธิ์.epub" },
            { name: "ตอนที่ 74 : รอยเท้าที่มั่นคงบนแผ่นดินแม่", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 74_ รอยเท้าที่มั่นคงบนแผ่นดินแม่.epub" },
            { name: "ตอนที่ 75 : อาณาจักรแห่งพันธสัญญาและหยาดเหงื่อที่เบ่งบาน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 75_ อาณาจักรแห่งพันธสัญญาและหยาดเหงื่อที่เบ่งบาน.epub" },
            { name: "ตอนที่ 76 : บทพิสูจน์แห่งหัวใจ", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 76_ บทพิสูจน์แห่งหัวใจ.epub" },
            { name: "(บทส่งท้าย) : อาณาจักรแห่งรักนิรันดร์", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/(บทส่งท้าย)_ อาณาจักรแห่งรักนิรันดร์.epub" },
            { name: "ตอนพิเศษ : วิศวกรวางแผนวิวาห์ (ฉบับนอมินีเจ้าเดิม)", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนพิเศษ_ วิศวกรวางแผนวิวาห์ (ฉบับนอมินีเจ้าเดิม).epub" },
            { name: "ตอนพิเศษ : เดิมพันสุดท้ายที่ปลายเตียง", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนพิเศษ_ เดิมพันสุดท้ายที่ปลายเตียง.epub" },
            { name: "ตอนพิเศษ : อาณาจักรแห่งรักนิรันดร์", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนพิเศษ_ อาณาจักรแห่งรักนิรันดร์.epub" },
            { name: "คุยกับนักเขียน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/คุยกับนักเขียน.epub" }
        ]
    },
    'Jin-ius Mechanic: กลไก (รัก) ฉบับเพลย์บอย [เล่ม1]': {
        title: "Jin-ius Mechanic: กลไก (รัก) ฉบับเพลย์บอย [เล่ม1]",
        cover: "assets/Jin-ius Mechanic_ กลไก (รัก) ฉบับเพลย์บอย_1.png",
        desc: "ในโลกของวิศวะ... ทุกอย่างมีเหตุผลและที่มา แต่ในโลกของ 'พลอยไพลิน' ... 'จิน' กลับหาคำตอบไม่ได้เลย หรือบางทีความรักครั้งนี้ อาจไม่ต้องใช้สูตรคำนวณ แต่ต้องใช้หัวใจล้วนๆ ในการถอดรหัส",
        chapters: [
            { name: "คุยกับนักเขียน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/คุยกับนักเขียน.epub" },
            { name: "แนะนำตัวละคร", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/แนะนำตัวละคร.epub" },
            { name: "บทนำ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/บทนำ.epub" },
            { name: "ตอนที่ 1 : อัลกอริทึมของความวุ่นวาย", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 1_ อัลกอริทึมของความวุ่นวาย.epub" },
            { name: "ตอนที่ 2 : รหัสลับในกลิ่นน้ำหอม", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 2_ รหัสลับในกลิ่นน้ำหอม.epub" },
            { name: "ตอนที่ 3 : ระบบรวนชั่วคราว", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 3_ ระบบรวนชั่วคราว.epub" },
            { name: "ตอนที่ 4 : กลไกที่ซ่อนอยู่", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 4_ กลไกที่ซ่อนอยู่.epub" },
            { name: "ตอนที่ 5 : กาแฟแก้วเดียวที่คำนวณไม่ได้", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 5_ กาแฟแก้วเดียวที่คำนวณไม่ได้.epub" },
            { name: "ตอนที่ 6 : วิศวกรรมย้อนรอย", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 6_ วิศวกรรมย้อนรอย.epub" },
            { name: "ตอนที่ 7 : ตัวแปรที่ไม่คงที่", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 7_ ตัวแปรที่ไม่คงที่.epub" },
            { name: "ตอนที่ 8 : แรงโน้มถ่วงระหว่างบรรทัด", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 8_ แรงโน้มถ่วงระหว่างบรรทัด.epub" },
            { name: "ตอนที่ 9 : ค่าความเชื่อมั่นที่เปลี่ยนไป", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 9_ ค่าความเชื่อมั่นที่เปลี่ยนไป.epub" },
            { name: "ตอนที่ 10 : ตัวแปรที่ควบคุมไม่ได้", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 10_ ตัวแปรที่ควบคุมไม่ได้.epub" },
            { name: "ตอนที่ 11 : ทฤษฎีความเชื่อมั่น", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 11_ ทฤษฎีความเชื่อมั่น.epub" },
            { name: "ตอนที่ 12 : ค่าคงที่ของความจริงใจ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 12_ ค่าคงที่ของความจริงใจ.epub" },
            { name: "ตอนที่ 13 : ระบบพยากรณ์ความรู้สึก", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 13_ ระบบพยากรณ์ความรู้สึก.epub" },
            { name: "ตอนที่ 14 : จุดคุ้มทุนแห่งความเชื่อใจ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 14_ จุดคุ้มทุนแห่งความเชื่อใจ.epub" },
            { name: "ตอนที่ 15 : รสชาติของความจริงใจ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 15_ รสชาติของความจริงใจ.epub" },
            { name: "ตอนที่ 16 : ความลับใต้ชายคา", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 16_ ความลับใต้ชายคา.epub" },
            { name: "ตอนที่ 17 : แสงแรกแห่งพันธสัญญา", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 17_ แสงแรกแห่งพันธสัญญา.epub" },
            { name: "ตอนที่ 18 : ระยะห่างที่ถูกย่อด้วย 'ความเชื่อมั่น'", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 18_ ระยะห่างที่ถูกย่อด้วย 'ความเชื่อมั่น'.epub" },
            { name: "ตอนที่ 19 : ปีกสีขาวกับใจที่ไหวระริก", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 19_ ปีกสีขาวกับใจที่ไหวระริก.epub" },
            { name: "ตอนที่ 20 : ค่ำคืนในหอคอยกระจก", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 20_ ค่ำคืนในหอคอยกระจก.epub" },
            { name: "ตอนที่ 21 : เส้นกั้นที่มองไม่เห็น", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 21_ เส้นกั้นที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 22 : เงาสะท้อนใต้แสงจันทร์", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 22_ เงาสะท้อนใต้แสงจันทร์.epub" },
            { name: "ตอนที่ 23 : รากฐานแห่งอนาคต", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 1]/ตอนที่ 23_ รากฐานแห่งอนาคต.epub" }
            
        ]
    },
    'Jin-ius Mechanic: กลไก (รัก) ฉบับเพลย์บอย [เล่ม2]': {
        title: "Jin-ius Mechanic: กลไก (รัก) ฉบับเพลย์บอย [เล่ม2]",
        cover: "assets/Jin-ius Mechanic_ กลไก (รัก) ฉบับเพลย์บอย_2.png",
        desc: "ในโลกของวิศวะ... ทุกอย่างมีเหตุผลและที่มา แต่ในโลกของ 'พลอยไพลิน' ... 'จิน' กลับหาคำตอบไม่ได้เลย หรือบางทีความรักครั้งนี้ อาจไม่ต้องใช้สูตรคำนวณ แต่ต้องใช้หัวใจล้วนๆ ในการถอดรหัส",
        chapters: [
            { name: "ตอนที่ 24 : รอยไหม้และแผนที่จุดประกาย", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 24_ รอยไหม้และแผนที่จุดประกาย.epub" },
            { name: "ตอนที่ 25 : กลไกแห่งความเชื่อมั่น", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 25_ กลไกแห่งความเชื่อมั่น.epub" },
            { name: "ตอนที่ 26 : กลยุทธ์เหนือระดับและพันธสัญญาใจ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 26_ กลยุทธ์เหนือระดับและพันธสัญญาใจ.epub" },
            { name: "ตอนที่ 27 : ก้าวแรกของจิรายุ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 27_ ก้าวแรกของจิรายุ.epub" },
            { name: "ตอนที่ 28 : ความมั่นใจที่กำลังเบ่งบาน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 28_ ความมั่นใจที่กำลังเบ่งบาน.epub" },
            { name: "ตอนที่ 29 : ความจริงที่แตกสลาย", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 29_ ความจริงที่แตกสลาย.epub" },
            { name: "ตอนที่ 30 : เงาที่มองไม่เห็น", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 30_ เงาที่มองไม่เห็น.epub" },
            { name: "ตอนที่ 31 : เมื่อความจริงใจ... ไม่ใช่แค่สถิติ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 31_ เมื่อความจริงใจ... ไม่ใช่แค่สถิติ.epub" },
            { name: "ตอนที่ 32 : พันธนาการและทางเลือก", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 32_ พันธนาการและทางเลือก.epub" },
            { name: "ตอนที่ 33 : กลิ่นหอมที่แตกต่าง", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 33_ กลิ่นหอมที่แตกต่าง.epub" },
            { name: "ตอนที่ 34 : สัญญาณจากกรงทอง", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 34_ สัญญาณจากกรงทอง.epub" },
            { name: "ตอนที่ 35 : เกมอันตรายของฌอง-ปิแอร์", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 35_ เกมอันตรายของฌอง-ปิแอร์.epub" },
            { name: "ตอนที่ 36 : วิศวกรรมกู้ชีพ", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 36_ วิศวกรรมกู้ชีพ.epub" },
            { name: "ตอนที่ 37 : สมรภูมิข้ามคืน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 37_ สมรภูมิข้ามคืน.epub" },
            { name: "ตอนที่ 38 : ยุทธการข้ามทวีป", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 38_ ยุทธการข้ามทวีป.epub" },
            { name: "ตอนที่ 39 : รอยร้าวในอาณาจักรแก้ว", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 39_ รอยร้าวในอาณาจักรแก้ว.epub" },
            { name: "ตอนที่ 40 : คำมั่นสัญญาที่ริมแม่น้ำแซน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 40_ คำมั่นสัญญาที่ริมแม่น้ำแซน.epub" },
            { name: "ตอนที่ 41 : กลไกแห่งความเชื่อมั่นที่จับต้องได้", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 41_ กลไกแห่งความเชื่อมั่นที่จับต้องได้.epub" },
            { name: "ตอนที่ 42 : บทพิสูจน์ศักดิ์ศรีตระกูลเตชะสิทธิสกุล", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 42_ บทพิสูจน์ศักดิ์ศรีตระกูลเตชะสิทธิสกุล.epub" },
            { name: "ตอนที่ 43 : รุ่งอรุณแห่งดาวดิน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/ตอนที่ 43_ รุ่งอรุณแห่งดาวดิน.epub" },
            { name: "บทส่งท้าย : อัลกอริทึมแห่งรักแท้และรุ่งอรุณที่ยั่งยืน", file: "books/Jin-ius Mechanic กลไก (รัก) ฉบับเพลย์บอย [เล่ม 2]/บทส่งท้าย_ อัลกอริทึมแห่งรักแท้และรุ่งอรุณที่ยั่งยืน.epub" }
            
        ]
    },
    'Time-less Engine: กลไก (รัก) หยุดเวลา [เล่ม1]': {
        title: "Time-less Engine: กลไก (รัก) หยุดเวลา [เล่ม1]",
        cover: "assets/Time-less Engine กลไก (รัก) หยุดเวลา_1.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 50 : พันธนาการใต้เงาอัครโภคิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 50_ พันธนาการใต้เงาอัครโภคิน.epub" }
            
        ]
    },
    'Time-less Engine: กลไก (รัก) หยุดเวลา [เล่ม2]': {
        title: "Time-less Engine: กลไก (รัก) หยุดเวลา [เล่ม2]",
        cover: "assets/Time-less Engine กลไก (รัก) หยุดเวลา_2.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 50 : พันธนาการใต้เงาอัครโภคิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 50_ พันธนาการใต้เงาอัครโภคิน.epub" }
            
        ]
    },
        'คุณชายยอดมังกร': {
        title: "คุณชายยอดมังกร",
        cover: "assets/คุณชายยอดมังกร_1.png",
        desc: "เมื่อ ‘กลไก’ ที่สมบูรณ์แบบที่สุด... ต้องมาพ่ายแพ้ให้กับ ‘หัวใจ’ ที่เรียบง่ายที่สุด",
        chapters: [
            { name: "ตอนที่ 50 : พันธนาการใต้เงาอัครโภคิน", file: "books/Engineering the Heart กลไกหัวใจนายวิศวะ [เล่ม 3]/ตอนที่ 50_ พันธนาการใต้เงาอัครโภคิน.epub" }
            
        ]
    }
};